WF/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <basedOn>Document.ЗаказыПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказыПоставщику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокРасходников</name>
    <attributes>
      <name>Расходник</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WF/src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокМатериаловЦенаПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СписокМатериаловКоличествоПриИзменении(Элемент)
	РасчетСтрокиМатериалы();
КонецПроцедуры

&НаКлиенте
Процедура СписокРасходниковЦенаПриИзменении(Элемент)
	РасчетСтрокиРасходники();
КонецПроцедуры     


&НаКлиенте
Процедура СписокРасходниковКоличествоПриИзменении(Элемент)
	РасчетСтрокиРасходники();
КонецПроцедуры

&НаКлиенте
Процедура РасчетСтрокиМатериалы()
	
	СтрокаРасчета = Элементы.СписокМатериалов.ТекущиеДанные; 
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	
КонецПроцедуры 

&НаКлиенте
Процедура РасчетСтрокиРасходники()
	
	СтрокаРасчета = Элементы.СписокРасходников1; 
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	
КонецПроцедуры
